DataProcessors/РаботаСПеречислениямиАдминистрированиеПрава.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РаботаСПеречислениямиАдминистрированиеПрава</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыТранспортныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мотоцикл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автобус</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самолет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПризнакКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПризнакКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДниНедели</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РаботаСПеречислениямиАдминистрированиеПрава/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ВывестиПеречислениеНаСервере()
	
	ВТС=Перечисления.ВидыТранспортныхСредств.Мотоцикл;
	//ПредопределенноеЗначение("Перечисление.ДниНедели.Среда") ;
	Сообщить(Перечисления.ПризнакКлиента.Организация);
	Сообщить(Перечисления.ПризнакКлиента.ЧастноеЛицо);
	Признаки = Перечисления.ПризнакКлиента;
	Сообщить("Проход по элементам в цикле");
	Для каждого ЭлементПеречисления Из Признаки Цикл
		Сообщить(ЭлементПеречисления);
	КонецЦикла;
	Сообщить("Обращение по индексу");
	Сообщить(Перечисления.ПризнакКлиента[0]);
	Сообщить(Перечисления.ПризнакКлиента[1]);
	ТекИндекс =Перечисления.ПризнакКлиента.Индекс( Перечисления.ПризнакКлиента.Организация);
	Сообщить("Индекс в перечислении " +ТекИндекс);
	ТекИндекс1 =Перечисления.ДниНедели.Индекс( Перечисления.ДниНедели.Среда);
	Сообщить("Индекс в перечислении " +ТекИндекс1);
	МойДеньНедели = ДеньНедели(ТекущаяДата());
	Сообщить(Перечисления.ДниНедели[МойДеньНедели-1]);
	//Перечисления.Месяцы.Январь
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПеречисление(Команда)
	ВывестиПеречислениеНаСервере();
	Сообщить("На клиенте");
	
	УНасСегодня =ПредопределенноеЗначение("Перечисление.ДниНедели.Понедельник"); 
	Орг = ПредопределенноеЗначение("Перечисление.ПризнакКлиента.Организация");
	Грн =ПредопределенноеЗначение("Справочник.Валюты.НациональнаяВалюта") ;
	Сообщить(ПредопределенноеЗначение("Перечисление.ПризнакКлиента.Организация"));
	Сообщить(ПредопределенноеЗначение("Перечисление.ПризнакКлиента.ЧастноеЛицо"));
КонецПроцедуры

&НаСервере
Процедура ПроверкаПравНаСервере()
	ТекВалюта = Константы.ВалютаУчета.Получить();
	ТекВалютаОбъект =ТекВалюта.ПолучитьОбъект();
	ТекВалютаОбъект.Наименование="ГРН1";
	ТекВалютаОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПрав(Команда)
	ПроверкаПравНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаДоступностиРолиНаСервере()
	Если РольДоступна("Продавец") Тогда
		
		Сообщить("Роль " +"""Продавец"""+" доступна" );
		
	Иначе
		Сообщить("Роль " +"""Продавец"""+" не доступна" );
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДоступностиРолиНаша(Команда)
	ПроверкаДоступностиРолиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПользователиИБНаСервере()
	Сообщить(ПользователиИнформационнойБазы.ТекущийПользователь());
	СписокПользователей =ПользователиИнформационнойБазы.ПолучитьПользователей();
	СписокРолей = Неопределено;
	Для каждого ПользовательИБ Из  СписокПользователей Цикл
		СписокРолей = ПользовательИБ.Роли;
		
		
	КонецЦикла; 
	ОбъектПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда
		ОбъектПользователь.ПолноеИмя = "Петренко";
		
	Иначе	
		ОбъектПользователь.ПолноеИмя = ПолноеИмя;
		
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Имя) Тогда
		
		ОбъектПользователь.Имя = "Петренко";
	Иначе	
		ОбъектПользователь.Имя = Имя;
		
	КонецЕсли; 	
	ОбъектПользователь.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиИБ(Команда)
	ПользователиИБНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НашаКоманда(Команда)
	Сообщить(ВернутьОсновнуюОрганизацию()) ;
КонецПроцедуры
&НаСервереБезКонтекста
Функция ВернутьОсновнуюОрганизацию()
	
	Возврат Константы.ОсновнаяОрганизация.Получить();
	
КонецФункции // ВернутьОсновнуюОрганизацию()

&НаСервереБезКонтекста
Процедура ХочуПолучитьДанные()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ХочуПолучитьДанные();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДемонстрацияНарушенияПравНаСервере()
	ТекКонтрагент = Справочники.Контрагенты.ЧастноеЛицо;
	ТекКонтрагентОбъект =ТекКонтрагент.ПолучитьОбъект();
	ТекКонтрагентОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДемонстрацияНарушенияПрав(Команда)
	ДемонстрацияНарушенияПравНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Команда2НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Команда2НаСервере();
	МояОбработкаКоманды2();
КонецПроцедуры

&НаКлиенте

Процедура МояОбработкаКоманды2()

	

КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеДня()
	ТекДеньНедели = "";
	МойДеньНедели = ДеньНедели(ТекущаяДата());
	ТекДеньНедели = Перечисления.ДниНедели[МойДеньНедели-1];
	
	Возврат  ТекДеньНедели ;
	
	
КонецФункции // ()

&НаСервереБезКонтекста
Функция ПоказатьНаименованиеДняНеделиНаСервере()
	Возврат Перечисления.ДниНедели[ДеньНедели(ТекущаяДата())-1];	
КонецФункции

&НаКлиенте
Процедура ПоказатьНаименованиеДняНедели(Команда)
	Сообщить(ПоказатьНаименованиеДняНеделиНаСервере());
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьНомерДняНедели(Команда)
	
	  Сообщить(ДеньНедели(ТекущаяДата()));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьКомандуПриИзменении(Элемент)
	Если ПоказыватьКоманду Тогда
		
		Элементы.ФормаПоказатьНомерДняНедели.Видимость=Истина;
	Иначе
		Элементы.ФормаПоказатьНомерДняНедели.Видимость=Ложь;
		
		
	КонецЕсли; 
КонецПроцедуры


//&НаКлиенте
//Процедура ВывестиНаименованиеДня(Команда)
//	НаименованиеДняТекущее = НаименованиеДня() ;
//	Сообщить(НаименованиеДняТекущее) ;
//КонецПроцедуры
